Repository: victorabda/desafio_mobile
Catalog: ByCodersChallenge/ByCodersChallenge/Localizable.xcstrings
Source language: en
Languages: pt_br

# common.cancel
source: Cancel
pt_br: Cancelar

# common.logout
source: Log out
pt_br: Sair

# common.retry
source: Try again
pt_br: Tentar novamente

# common.user
source: User
pt_br: Usuário

# home.error.title
source: Unable to load the map
pt_br: Não foi possível carregar o mapa

# home.greeting
source: Hello,
pt_br: Olá,

# home.loading.message
source: This should only take a few seconds.
pt_br: Isso deve levar apenas alguns segundos.

# home.loading.title
source: Finding your location
pt_br: Buscando sua localização

# home.location.error
source: Unable to load your location.
pt_br: Não foi possível carregar sua localização.

# home.logout.confirmation
source: Do you want to log out?
pt_br: Deseja sair da sua conta?

# home.logout.error.message
source: Unable to log out of your account.
pt_br: Não foi possível sair da sua conta.

# home.logout.error.title
source: Logout error
pt_br: Erro ao sair

# home.stale_location.message
source: Showing your last saved location. It may be outdated.
pt_br: Exibindo sua última localização salva. Ela pode estar desatualizada.

source: Location permission denied.
pt_br: Permissão de localização negada.

source: Location unavailable.
pt_br: Localização indisponível.

# login.copyright
source: Developed by **Victor Augusto Borges Dias de Almeida** for the ByCoders iOS developer challenge.
pt_br: Desenvolvido por **Victor Augusto Borges Dias de Almeida**, teste de desenvolvedor iOS para a empresa ByCoders.

# login.description
source: Sign in to view your current position on the map and keep your last location saved on this device.
pt_br: Entre para visualizar sua posição atual no mapa e manter sua última localização salva no dispositivo.

# login.error
source: Unable to sign in.
pt_br: Não foi possível realizar o login.

# login.instructions
source: Use your email and password to continue.
pt_br: Use seu email e senha para continuar.

# login.password
source: Password
pt_br: Senha

# login.password.hide
source: Hide password
pt_br: Ocultar senha

# login.password.show
source: Show password
pt_br: Exibir senha

# login.privacy
source: Your sign-in data is protected by Firebase Authentication.
pt_br: Seus dados de acesso são protegidos pelo Firebase Authentication.

# login.sign_in
source: Sign in
pt_br: Entrar

# login.title
source: My Location
pt_br: Minha Localização

# login.welcome
source: Welcome
pt_br: Boas-vindas

# map.recenter
source: Return to my location
pt_br: Voltar para minha localização

# map.user_location
source: Your location
pt_br: Sua localização

# permission.description
source: Location access is used only to find your current position and display it on the map.
pt_br: A localização é usada somente para encontrar sua posição atual e exibi-la no mapa.

# permission.open_settings
source: Allow in Settings
pt_br: Permitir nos Ajustes

# permission.privacy.message
source: You can remove this permission at any time.
pt_br: Você pode remover essa permissão a qualquer momento.

# permission.privacy.title
source: Respect your privacy
pt_br: Respeitar sua privacidade

# permission.save_location.message
source: Your last position is stored locally on this device.
pt_br: Sua última posição fica armazenada localmente no dispositivo.

# permission.save_location.title
source: Save the last location
pt_br: Salvar a última localização

# permission.show_position.message
source: The map is centered on your current position.
pt_br: Centralizamos o mapa no ponto em que você está.

# permission.show_position.title
source: Show your position
pt_br: Mostrar sua posição

# permission.title
source: We need your location
pt_br: Precisamos da sua localização

# session.restoring
source: Restoring session...
pt_br: Restaurando sessão...
